using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class ToDo : MonoBehaviour
{
    /*
        1) Импортировать ассеты в Юнити
        2) ЛоадерСкрипт - Закинуть в ресурсы, папка с именем, в ней текстуры и джейсоны
            Функция сёрчит папку по подходящему имени, пикает оттуда джейсоны и билдит мапу
        3) КамераКонтролс - Просто мышью или тапами перемещаем карту или типа того
        4) ПростойУИ - При нажатии выводит окно, в нём текст и кнопка
            Текст - имя спрайта, который находится ближе всего к левому-верхнему углу камеры
            Нажатие по кнопке - закрывает окно, а еще и камера не двигается
        5) Зуминг
        6) ХардДжейсон, работающий с разрывами

        1h 11min
    */
}
